Revit 2021.1 API
FormatOptions Constructor (DisplayUnitType, UnitSymbolType)
 Creates a new FormatOptions object that represents custom formatting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This constructor is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `FormatOptions(ForgeTypeId, ForgeTypeId)` overload instead.")]
public FormatOptions(
	DisplayUnitType displayUnit,
	UnitSymbolType unitSymbol
)
Visual Basic
<ObsoleteAttribute("This constructor is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `FormatOptions(ForgeTypeId, ForgeTypeId)` overload instead.")> _
Public Sub New ( _
	displayUnit As DisplayUnitType, _
	unitSymbol As UnitSymbolType _
)
Visual C++
[ObsoleteAttribute(L"This constructor is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `FormatOptions(ForgeTypeId, ForgeTypeId)` overload instead.")]
public:
FormatOptions(
	DisplayUnitType displayUnit,
	UnitSymbolType unitSymbol
)
Parameters
displayUnit
Type: Autodesk.Revit.DB.DisplayUnitType
 The display unit.
unitSymbol
Type: Autodesk.Revit.DB.UnitSymbolType
 The unit symbol.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  displayUnit is an invalid display unit. See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits(). -or- unitSymbol is not a valid unit symbol for displayUnit.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
FormatOptions Class
FormatOptions Overload
Autodesk.Revit.DB Namespace